{
  "main": "Главная",
  "aboutGame": "Об игре",
  "aboutAuthors": "Об авторах",
  "profile": "Профиль",
  "logout": "Выйти",
  "login": "Войти",
  "post":"Электронная почта",
  "password":"Пароль",
  "username":"имя пользователя:",
  "register":"зарегистрироваться",
  "roomName":"Название комнаты",
  "delete":"Удалить",
  "IdRoom":"ID комнаты",
  "roomId":"Комната с id",
  "notFound":"не найдена",
  "changePhoto":"изменить изображение",
  "wins":"победы:",
  "defeats":"поражения:",
  "open":"Открытый",
  "closed":"Закрытый",
  "type":"Тип",
  "status":"Статус",
  "actions":"Действия",
  "players":"Пользователи",
  "vote":"Голосовать",


  "developers": {
    "1": {
      "fullName": "Старовойтов Иван Юрьевич",
      "position": "Fullstack Developer",
      "age": "19",
      "text": "Главный дебаггер гитхаба. Работал над архитектурой проекта и связью между клиентской и серверной части, а так же связью между командой.Занимался интеграцией различных компонентов системы и обеспечением надежности и производительности приложения. Люблю сырки и чай."
    },
    "2": {
      "fullName": "Савельев Иван Павлович",
      "position": "Backend Developer",
      "age": "20",
      "text": "Начинающий разработчик, .NET developer. Работаю преимущественно над бизнес логикой приложений (в командных проектах). Мои основные задачи включают проектирование и разработку серверной логики, интеграцию с базами данных и обеспечение безопасности приложений."
    },
    "3": {
      "fullName": "Походня Денис Александрович",
      "position": "Backend Developer",
      "age": "20",
      "text": "Отвечаю за организацию и хранение данных, а также за связь между базой данных и серверной частью. Использую такие технологии, как Entity Framework Core, PostgreSQL."
    },
    "4": {
      "fullName": "Бондарь Юлия Владимировна",
      "position": "Frontend Developer",
      "age": "19",
      "text": "Отвечаю за визуальную часть проекта, внедрение backend в frontend. Использую такие технологии, как HTML, CSS, JavaScript, фреймворк React для создания интерактивных интерфейсов. Обеспечиваю кросс-браузерную совместимость."
    }
  },

    "gameRules": {
      "1": {
        "role": "Мафия",
        "content": "Мафия — популярная психологическая игра. Сюжет прост. Мирные жители города, которые устали от распоясавшейся мафии, решают устроить самосуд и убивать преступников. Мафия в ответ объявляет войну с целью уничтожить всех горожан. Команды мафии и мирных жителей играют друг против друга. Мирные жители выигрывают, если вычисляют и «отправляют на смерть» всех мафиози. Мафия выигрывает, если победа мирных жителей математически невозможна."
      },
      "2": {
        "role": "Роль, которую вы можете получить в игре:",
        "content": "Мирный (красный). Задача игрока заключается в том, чтобы выявить членов мафии и путем голосования выгнать их из города.",
        "content2": "Доктор (красный). Задача доктора — вылечить выбранного игрока, чтобы не допустить его гибели от выстрела мафии. Просыпается ночью.",
        "content3": "Шериф (красный). Цель героя состоит в проверке игроков, с помощью которой он выявляет связь с мафией. Просыпается ночью, действует в пользу мирных.",
        "content4": "Мафия (черный). Цель игры для каждого из напарников заключается в том, чтобы изгнать из города максимальное число мирных жителей в дневное время или застрелить их ночью. Мафия выигрывает, если число ее участников становится равным количеству игроков, которые играют за мирных жителей.",
        "content5": "Дон (черный). Глава мафии. Он просыпается в ночное время, чтобы проверить наличие удостоверения у игрока, которого считает возможным Шерифом. Дон определяет очередность убийств, совершаемых мафией."
      },
      "3": {
        "role": "Победа",
        "content": "Победа мафии наступает, когда количество игроков, которые выполняют роль мирных жителей, равно числу членов мафии. Победа мирных наступает, когда из города изгнаны все представители черных.",
        "content2": "Победа мирных наступает, когда из города изгнаны все представители черных.",
        "content3": "Места за столом распределяются произвольно, у игроков нет возможности выбора роли. Информация об этом выводится на экран. Чтобы познакомиться с ролью, выбрать карту каждому по очереди будет предоставлено по 10 секунд."
      },
      "4": {
        "role": "Первая ночь",
        "content": "Первая ночь позволяет игрокам черной команды познакомиться. Они видят друг друга благодаря включенным камерам, могут открыто общаться в течение 30 секунд. Дон за это время должен показать другим черным сигналом свою роль в игре, определить кого стрелять в ближайшую ночь.",
        "content2": "Днем все игроки видят друг друга через камеры, выражают свое мнение, приводят аргументы, оправдываются, если считают нужным. Судьба выбранной на роль участника мафии кандидатуры решается голосованием. Каждому при этом дается по 1 минуте."
      },
      "5": {
        "role": "Голосование",
        "content": "К этому этапу голосования игра переходит после окончания последней оправдательной речи (оправдательная речь даётся всем выставленным на голосование игрокам). На голосование отводится 10 секунд, в течение которых каждый определяет для себя одного игрока – кандидата на изгнание. Отсутствие голоса от кого-либо система автоматически засчитает отданным за последнего выставленного кандидата.",
        "content2": "Голосование может не проводиться только в первый день, если представлена только одна кандидатура. В оставшееся время эта процедура проводится обязательно. Игру покидает тот, кому отдано большинство голосов.",
        "content3": "Если несколько кандидатов получили одинаковое количество голосов, им дается дополнительное время, чтобы аргументировать свою позицию. Если ситуация повторяется при следующем голосовании, игроки принимают решение о том, чтобы оставить или выгнать обоих участников сразу.",
        "content4": "Покинувший игру не раскрывает свою роль до ее завершения. Ему предоставляется 30 секунд, чтобы произнести прощальную речь."
      },
      "6": {
        "role": "После первой ночи",
        "content": "С наступлением ночного времени за исключением первой ночи представители мафии могут сделать выстрел в выбранном окошке нажатием кнопки. Чтобы вывести из игры жертву, черные должны выбрать одного из кандидатов вместе. Если кто-то выбрал на эту роль другого или отказался от выстрела, система фиксирует действие как промах, из-за которого никто не покинет игру по результатам ночи.",
        "content2": "После совершения выстрелов Дон пользуется функцией проверки выбранного игрока, чтобы выявить Шерифа или получить информацию о его роли. После этого к аналогичной процедуре приступает Шериф, но статус Дона таким способом выяснить нельзя. Информация ограничивается причастием к команде черных. Затем к этой же процедуре приступает Доктор.",
        "content3": "Если мафия попала, умерший игрок имеет право оставить подозрительных игроков."
      },
      "7": {
        "role": "День сменяется ночью, действия игроков повторяются до момента, когда команда-победитель будет определена."
      }
    },
  
  

  "Profile":{
    "editProfile":"Редактировать профиль",
    "logIn": "Авторизоваться",
    "SaveChanges":"Сохранить изменения",
    "ResetChanges":"Сбросить изменения",
    "DeleteProfile":"Удалить профиль",
    "AcceptRules":"Я принимаю правила сайта",
    "acceptPrivacyPolicy": "Я принимаю политику конфиденциальности"
  },

  "stateLobby":{
    "create":"Создать",
    "createLobby":"создать лобби",
    "entranceInLobby":"Войти в лобби",
    "deleteLobby":"Удалить лобби",
    "play":"играть"
  },

  "forgotPassword": {
    "forgotPassword":"Забыли пароль?",
    "title": "Восстановление пароля",
    "emailLabel": "Введите вашу электронную почту",
    "submitButton": "Получить пароль"
  },

  "WebChat":{
    "ready":"Готов",
    "CameraOn":"Камера вкл.",
    "CameraOff":"Камера выкл.",
    "MicrophoneOn":"Микрофон вкл.",
    "MicrophoneOff":"Микрофон выкл.",
    "ConfirmReadiness":"Подтвердите готовность",
    "WaitingPlayer":"Ожидание игрока"
  },


  "toastError":{
      "personIdNotFound":"ID пользователя не найден",
      "RoomNameRequired":"Название комнаты обязательно для заполнения",
      "NamAlreadyExists":"Лобби с таким названием уже существует",
      "errorCreating":"Ошибка при создании комнаты",
      "errorDelete":"Ошибка при удалении лобби:",
      "errorLoading":"Ошибка при загрузке лобби",
      "ConnectionError":"Ошибка подключения, повторите еще раз",
      "idPersonNotFound":"ID пользователя не найден",
      "IdRoomIsEmpty":"ID комнаты не может быть пустым",
      "passwordIsNotEmpty":"Пароль не может быть пустым",
      "EntranceInSystem":"Пожалуйста, войдите в систему и повторите попытку",
      "FailedSave":"Не удалось сохранить изменения, попробуйте снова.",
      "ErrorDeleteProfile":"Возникла ошибка при удалении профиля, попробуйте еще раз",
      "UserNotFound":"Пользователь не найден, зарегистрируйтесь или проверьте вводимые данные",
      "RegistrationError":"Ошибка регистрации. Проверьте введенные данные и повторите попытку.",
      "ErrorEmail":"Пожалуйста, введите правильный адрес электронной почты.",
      "ErrorData":"Данные пользователя или лобби отсутствуют.",
      "ErrorLogOutLobby":"Произошла ошибка при выходе из лобби. Попробуйте снова."
    },

    "toastSuccess":{
      "createdRoom":"Вы создали комнату с именем",
      "lobbyWithId":"Лобби с ID",
      "SuccessDelete":"успешно удалено",
      "SuccessfullyEntered":"Вход выполнен успешно!",
      "SuccessfullyDelete":"Профиль успешно удален!",
      "SuccessfullySave":"Изменения успешно сохранены!",
      "SuccessRegistration":"Регистрация прошла успешно! Вы можете войти в систему!",
      "SuccessLogOut":"Вы успешно вышли из лобби!"
    },
    "toastInfo":{
      "InputId":"Пожалуйста, введите ID комнаты!",
      "roomIsCrowded":"Комната переполнена. Невозможно войти.",
      "question":"Вы уверены, что хотите удалить свой профиль?",
      "RemainLogged":"Вы остались в системе.",
      "loggedOut":"Вы вышли из системы.",
      "PrivacyPolicy":"Пожалуйста, примите правила сайта и политику конфиденциальности.",
      "GoOut":"Вы действительно хотите выйти?"
    }
}
